
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Параметры.Метод.Пустая() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаАртументов = Аргументы.Выгрузить();
	СтандартныеАргументы = Справочники.скт_Методы.НовыеАргументыВызоваМетода(Параметры.Метод);
	Для Каждого текАргумент Из СтандартныеАргументы Цикл
		НоваяСтрока = ТаблицаАртументов.Добавить();
		НоваяСтрока.Имя = текАргумент.Ключ;
		НоваяСтрока.Значение = текстовоеЗначениеТиповогоАргумента(текАргумент.Ключ, текАргумент.Значение);
	КонецЦикла;
	АргментыМетода = Параметры.Метод.Аргументы.Выгрузить();
	Для Каждого текАргумент Из АргментыМетода Цикл
		НоваяСтрока = ТаблицаАртументов.Добавить();
		НоваяСтрока.Имя = текАргумент.Имя;
		НоваяСтрока.Обязательный = текАргумент.Обязательный;
	КонецЦикла;
	Аргументы.Загрузить(ТаблицаАртументов);
	
	// добавить все возможные базовые параметры

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	Результат = Новый Структура;
	Для Каждого текАргумент Из Аргументы.НайтиСтроки(Новый Структура("Использовать", Истина)) Цикл
		Если текАргумент.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(текАргумент.Имя, текАргумент.Значение);
	КонецЦикла;
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАргументы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция текстовоеЗначениеТиповогоАргумента(ИмяАргумента, Значение)

	Если ИмяАргумента = "Формат" Тогда
		Возврат XMLСтрока(Значение);
	ИначеЕсли ИмяАргумента = "Архивировать" Тогда
		Возврат ?(Значение, 1, 0);
	ИначеЕсли ИмяАргумента = "СпособДоставки" Тогда
		Возврат ?(Значение = Перечисления.скт_СпособыДоставкиРезультата.ВыгрузкаВКаталог, 1, 0);
	Иначе
		Возврат Значение;
	КонецЕсли;

КонецФункции // текстовоеЗначениеТиповогоАргумента()


#КонецОбласти