#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция Сериализовать(РезультатВыполнения, Метод, Поток, выхРасширениеФайла) Экспорт 

	Если ТипЗнч(РезультатВыполнения) = Тип("ТабличныйДокумент") Тогда
		скт_ОбщегоНазначения.ДвоичныеДанныеТабличногоДокумента(РезультатВыполнения, ТипФайлаТабличногоДокумента.MXL, Поток);
		выхРасширениеФайла = "mxl";
	Иначе
		скт_ОбщегоНазначения.JSONПоТаблицеЗначений(РезультатВыполнения, Поток);
		выхРасширениеФайла = "json";
	КонецЕсли;

КонецФункции // ПолучитьРезультат()

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти