
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособДоставки = Перечисления.скт_СпособыДоставкиРезультата.Непосредственно Тогда
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПутьДляВыгрузки"));
		
	КонецЕсли;
	
	Если Формат <> Перечисления.скт_ВариантыФорматовВыгрузки.ПроизвольнаяСериализация Тогда
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Сериализация"));
		
	КонецЕсли;
	
	Для Индекс = 0 По Аргументы.Количество() - 1 Цикл
		
		текСтрока = Аргументы.Получить(Индекс);
		Если Не скт_ОбщегоНазначенияКлиентСервер.ЭтоВалидноеИмяПараметра(текСтрока.Имя) Тогда 
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + Индекс + " не корректно заполнено имя аргумента";
			Сообщение.Поле = "Аргументы[" + Индекс + "].Имя";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Код = Неопределено;
КонецПроцедуры

#КонецОбласти
