
#Область ПрограммныйИнтерфейс

Функция ЭтоВалидныйТекстЗапроса(ТекстЗапроса, РежимКомпоновки = Истина, Форматировать = Ложь, текстОшибки = "") Экспорт 

	текстОшибки = "";
	Схема = Новый СхемаЗапроса;
	Схема.РежимКомпоновкиДанных = РежимКомпоновки;
	Попытка
		Схема.УстановитьТекстЗапроса(ТекстЗапроса);
		Если Форматировать Тогда
			ТекстЗапроса = Схема.ПолучитьТекстЗапроса();
		КонецЕсли;
		Возврат Истина;
	Исключение
		текстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;

КонецФункции // ЭтоВалидныйТекстЗапроса()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти