
#Область ПрограммныйИнтерфейс

Функция Прочитать(ИмяКонстанты, ПроверятьПрава = Ложь) Экспорт

	Если Не ПроверятьПрава Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	Если Метаданные.Константы.Найти(ИмяКонстанты) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Константы[ИмяКонстанты].Получить();

КонецФункции // Прочитать()

Процедура Установить(ИмяКонстанты, Значение, ПроверятьПрава = Ложь) Экспорт

	Если Не ПроверятьПрава Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	Если Метаданные.Константы.Найти(ИмяКонстанты) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Константы[ИмяКонстанты].Установить(Значение);

КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти