
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		
		Возврат;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Значение = ПланыВидовХарактеристик.скт_ДополнительныеНастройки.ПолучитьЗначениеПоСсылке(Параметры.ЗначениеКопирования);
	КонецЕсли;
	
	Элементы.РежимПароля.Видимость = Объект.Ссылка.Пустая();
	Элементы.ТипЗначения.ТолькоПросмотр = Не Объект.Ссылка.Пустая();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РежимПароляПриИзменении(Элементы.РежимПароля);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗначениеНастройки", Значение);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Значение = ПланыВидовХарактеристик.скт_ДополнительныеНастройки.ПолучитьЗначениеПоСсылке(ТекущийОбъект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимПароляПриИзменении(Элемент)
	Элементы.Значение.РежимПароля = Объект.РежимПароля;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти