#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция КомпоновщикНастроек(Знач СсылкаОбъект, ПользовательскиеНастройки = Неопределено) Экспорт

	Схема = СсылкаОбъект.Схема.Получить();
	Настройки = СсылкаОбъект.Настройки.Получить();
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.ЗагрузитьНастройки(Настройки);
	Если ПользовательскиеНастройки <> Неопределено Тогда
		Компоновщик.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
	КонецЕсли;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	Компоновщик.Восстановить();
	
	Возврат Компоновщик;

КонецФункции // КомпоновщикНастроек()


Функция Скомпоновать(Знач СсылкаОбъект, Знач Настройки = Неопределено, ПриемникВывода = Неопределено,
	ВнешниеНаборы = Неопределено, ОтключитьОбщиеИтоги = Истина, МенеджерВременныхТаблиц = Неопределено) Экспорт

	Схема = СсылкаОбъект.Схема.Получить();
	Если Настройки = Неопределено Тогда
		Настройки = СсылкаОбъект.Настройки.Получить();
	КонецЕсли;
	Возврат скт_КомпоновкаДанныхСервер.Скомпоновать(Схема, Настройки, ПриемникВывода
		, ВнешниеНаборы, ОтключитьОбщиеИтоги, МенеджерВременныхТаблиц);

КонецФункции

#КонецОбласти

#КонецЕсли