

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Расположение = Перечисления.скт_ВариантыРасположенияАлгоритмов.ВнешнийФайл Тогда
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ИмяВстроеннойОбработки"));	
		
		//Если ХранилищеФайла.Получить() = Неопределено Тогда
		//	
		//	Сообщение = Новый СообщениеПользователю();
		//	Сообщение.Текст = "Не загружен файл внешней обработки с реализацией алгоритма";
		//	Сообщение.Поле = "ХранилищеФайла";
		//	Сообщение.УстановитьДанные(ЭтотОбъект);
		//	Сообщение.Сообщить();
		//	
		//	Отказ = Истина;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = Неопределено;
	Наименование = Неопределено;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти