#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПоИмени(Имя) Экспорт

	Если Метаданные.Перечисления.скт_ВариантыФорматовВыгрузки.ЗначенияПеречисления.Найти(Имя) <> Неопределено Тогда
		Возврат Перечисления.скт_ВариантыФорматовВыгрузки[Имя];	
	КонецЕсли;

КонецФункции // ПоИмени()

Функция РасширениеФайлаДляСохранения(Ссылка) Экспорт

	Если Ссылка = MXL Или Ссылка = MXL7 Тогда
		Возврат "mxl";
	ИначеЕсли Ссылка = PDF Тогда
		Возврат "pdf";
	ИначеЕсли Ссылка = XLSX Тогда
		Возврат "xlsx";
	ИначеЕсли Ссылка = ODS Тогда
		Возврат "ods";
	ИначеЕсли Ссылка = DOCX Тогда
		Возврат "docx";
	ИначеЕсли Ссылка = CSV Тогда
		Возврат "csv";
	ИначеЕсли Ссылка = XML Тогда
		Возврат "xml";
	ИначеЕсли Ссылка = JSON Тогда
		Возврат "json";
	Иначе
		Возврат "txt";
	КонецЕсли;

КонецФункции // РасширениеФайлаДляСохранения()

#КонецОбласти

#КонецЕсли