
#Область ПрограммныйИнтерфейс

// Функция - Это валидное имя параметра
//
// Параметры:
//  Имя	 - Строка - Имя, которое необходимо проверить
// 
// Возвращаемое значение:
//  Булево - Результат проверки имени
//
Функция ЭтоВалидноеИмяПараметра(Имя) Экспорт

	Попытка
		ф=Новый Структура(Имя,Неопределено);
	    Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;	

КонецФункции // ЭтоВалидноеИмяПараметра()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти