#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьРезультат(ВходящееЗначение, Метод, Схема, Компоновщик) Экспорт 

	Если Не ТипЗнч(ВходящееЗначение) = Тип("Строка") Тогда 
		Возврат ВходящееЗначение;
	КонецЕсли;
	
	Возврат ПрочитатьДатуJSON(ВходящееЗначение, ФорматДатыJSON.ISO);

КонецФункции // ПолучитьРезультат()

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти