
#Область ПрограммныйИнтерфейс

Функция ПрочитатьЗначение(КодИлиНастройка, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Возврат ПланыВидовХарактеристик.скт_ДополнительныеНастройки.ПрочитатьЗначение(КодИлиНастройка, ЗначениеПоУмолчанию);
	
КонецФункции // ПрочитатьЗначение()

Функция УстановитьЗначение(Ссылка, Значение) Экспорт
	
	РегистрыСведений.скт_ЗначенияДополнительныхНастроек.ЗаписатьНастройку(Ссылка, Значение);
	
КонецФункции // УстановитьЗначение()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти