
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомпоновщикВыбранныеПоля 		= Не ПустаяСтрока(Параметры.Компоновщик.Настройки.Выбор.ИдентификаторПользовательскойНастройки);
	КомпоновщикОтбор 				= Не ПустаяСтрока(Параметры.Компоновщик.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	КомпоновщикПорядок 				= Не ПустаяСтрока(Параметры.Компоновщик.Настройки.Порядок.ИдентификаторПользовательскойНастройки);
	КомпоновщикУсловноеоформление 	= Не ПустаяСтрока(Параметры.Компоновщик.Настройки.УсловноеОформление.ИдентификаторПользовательскойНастройки);
	КомпоновщикГруппировки 			= Не ПустаяСтрока(Параметры.Компоновщик.Настройки.Структура.ИдентификаторПользовательскойНастройки);
		
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("ВыбранныеПоля", КомпоновщикВыбранныеПоля);
	Результат.Вставить("Отбор", КомпоновщикОтбор);
	Результат.Вставить("Порядок", КомпоновщикПорядок);
	Результат.Вставить("Условноеоформление", КомпоновщикУсловноеоформление);
	Результат.Вставить("Структура", КомпоновщикГруппировки);
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти